# Pandas

In [24]:
import numpy as np
import pandas as pd

## Series

In [3]:
#Series is similar to numpy array
#Series can be accessed by labels

In [4]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c':30}

In [5]:
pd.Series(data=my_data)
#Series has Indices and Datapoints

0    10
1    20
2    30
dtype: int64

In [18]:
mySeries = pd.Series(data=my_data, index=labels)
#The Indices can be set separately
#short hand notation: 
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [19]:
mySeries['b']

20

In [11]:
#pd.Series can cast a numpy array, 
#exactly as np.array did with lists: 
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [12]:
#Given a dictionary, Pandas sets key as index and value as datapoint
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [15]:
#Series can hold 'anything' as datapoints, even functions: 
pd.Series(data=[sum, print, len, np.sqrt, np.pi])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
3               <ufunc 'sqrt'>
4                      3.14159
dtype: object

## Grab Information from Series:

In [16]:
ser1 = pd.Series([1,2,3,4], ['Apple', 'Banana', 'Orange', 'Blueberry'])

In [17]:
ser1

Apple        1
Banana       2
Orange       3
Blueberry    4
dtype: int64

In [21]:
ser1['Banana']

2

In [22]:
ser2 = pd.Series([3,2,1,5], ['Banana', 'Kiwi','Orange', 'Blueberry'])

In [23]:
ser1 + ser2
#Pandas adds values where Indices match
#No index-match results in NaN
#Numbers are converted into float to avoid information-loss

Apple        NaN
Banana       5.0
Blueberry    9.0
Kiwi         NaN
Orange       4.0
dtype: float64

## DataFrames

In [9]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [2]:
np.random.seed(101)

In [3]:
df = pd.DataFrame(randn(5,4), ['A', 'B', 'C', 'D','E'],['W','X','Y','Z'])

In [4]:
df
#now we see a nice output of our random data
#each colum is a series, the colums/series share same index in rows

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [10]:
#Data type of a dataframe - DataFrame :D
type(df)

pandas.core.frame.DataFrame

In [6]:
#Grab data:
df['W'] # grab W-Colum with bracket notation

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [7]:
#A row is indeed a series: 
type(df['W'])

pandas.core.series.Series

In [11]:
#Grab colum as with sql: 
df.W #dot-Notation
#advice: don't use this, confuses with methods on dataframes

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [12]:
#Grab multiple colums with list of colum-names:
df[['X', 'Z']]

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965
C  0.740122 -0.589001
D -0.758872  0.955057
E  1.978757  0.683509

In [13]:
#Creating new, non-existing, colum by arithmetic works
df['new'] = df['W'] + df['Y']

In [14]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [17]:
#delete Colum with the .drop method
#we need to specify axis: 
#axis refers to index
#axis = 0: for rows
#axis = 1: for colums

#reason for this: numpy-indexing of DataFrame:
#df.shape returns in our case (5,4) (after deletion, dataframe below)
#Tupel, so 2D-Matrix
#0-Index: Number of rows
#1-Index: Number of colums


#and we need to specify the inplace argument: 
#inplace=True: if you want those changes to be permanent

df.drop('new', axis=1, inplace=True)

In [18]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
#delete a row with same Method: 
df.drop('E', axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [22]:
df.shape

(5, 4)

In [23]:
#Selecting colums by df['X']
#Selecting rows: two different ways:

df.loc['A'] #pass the label

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [24]:
# pass the numerical index: 
df.iloc[0]
#i for integer/index
#loc for location
#we see, the rows are also returned as series

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [26]:
#select subsets of DataFrames: 
df.loc['B', 'Y'] #comma notation, just as with matrices in numpy
df.loc[['A', 'B'], ['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [8]:
#Conditional selection
booldf = df > 0 #create 'mask'
booldf #show 'mask'

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [9]:
#No slect conditionally: 
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [10]:
#now all in one step: 
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [13]:
#Just checking rows: 
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

### Following notation is used the most:

In [12]:
df[df['W']>0]
#returns only the rows, where Condition on W happens to be true
#we can call commands on the resulting DataFrame

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [15]:
#Return the X-Colum from conditionally selected df: 
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [17]:
#Multiple conditions: 
df[(df['W']>0) & (df['X']>1)] #only use & or | here
#the 'and'-Operator is just for Comparing one True with one False
'''
& ampersand 'and'
| pipe 'or'
'''

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [18]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
#Reset the index: 
df.reset_index()
#will only stay if you set inplace=True
#this sets old index as a new colum in the DataFrame
#and sets the index to a numerical index

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [22]:
#Create a new index: 
newind = 'CA NY WY OR CO'.split()

['CA', 'NY', 'WY', 'OR', 'CO']

In [25]:
#We can attach this to the df DataFrame
#put it as a new colum in the dataframe
#Dimensions match, so we can just write: 
df['States'] = newind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [26]:
#now we want the new colum to be the index: 
#we can use .set_index('colum to be index')
df.set_index('States')
#Caution: old index will be lost
#this is not inplace by default

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [31]:
import numpy as np
import pandas as pd

### Index Hierarchy

In [2]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside)) #creates a list of tupels
hier_index = pd.MultiIndex.from_tuples(hier_index) 
#this function can create multi-index from our tuple-list

In [7]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [11]:
df = pd.DataFrame(randn(6,2), hier_index, ['A', 'B'])

In [13]:
df #this Dataframe has index hierarchy: multiple stages of indices

             A         B
G1 1  0.340039 -0.155702
   2 -2.098030 -0.934979
   3 -0.439715  0.102969
G2 1  1.117472  0.199583
   2  1.780010 -1.835646
   3  0.644727  0.551879

In [15]:
# How to call data from this?
df.loc['G1'] #from outside to inside

          A         B
1  0.340039 -0.155702
2 -2.098030 -0.934979
3 -0.439715  0.102969

In [23]:
df.loc['G1'].loc[1] #from sub df call first row

A    0.340039
B   -0.155702
Name: 1, dtype: float64

In [24]:
#Now we want to name the index colums in the dataframe: 
df.index.names

FrozenList([None, None])

In [25]:
df.index.names = ['Groups', 'Numbers']

In [26]:
df

                       A         B
Groups Numbers
G1     1        0.340039 -0.155702
       2       -2.098030 -0.934979
       3       -0.439715  0.102969
G2     1        1.117472  0.199583
       2        1.780010 -1.835646
       3        0.644727  0.551879

In [30]:
df.loc['G2'].loc[2]['B']
df.loc['G1'].loc[3]['A']

-0.43971453053225829

### Cross Section

In [33]:
df.loc['G1'] #locating a sub df

                A         B
Numbers
1        0.340039 -0.155702
2       -2.098030 -0.934979
3       -0.439715  0.102969

In [34]:
df.xs('G1') #.xs method can also locate sub df

                A         B
Numbers
1        0.340039 -0.155702
2       -2.098030 -0.934979
3       -0.439715  0.102969

In [37]:
#The .xs mehtod can do more: 
df.xs(1, level='Numbers')
#We get a cross section of the first rows of the two groups

               A         B
Groups
G1      0.340039 -0.155702
G2      1.117472  0.199583

# Missing Values

In [13]:
#we don't want to have NaN in our Database, so let's do something about it
import numpy as np
import pandas as pd

## Drop missing values

In [2]:
#create dataframe from dictionary: 
d = {'A':[1,2,np.nan], 'B':[5,np.nan, np.nan], 'C':[1,2,3]}

In [5]:
df = pd.DataFrame(d)

In [6]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [7]:
#dropna method: 
df.dropna()
#this drops any row with at least one missing value

     A    B  C
0  1.0  5.0  1

In [9]:
#perform action on the colums: 
df.dropna(axis=1)
#drops any colums with null values in it

   C
0  1
1  2
2  3

In [12]:
df.dropna(thresh=2)
#threshold holds lines where there are at least two non-nan values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

## Fill missing values

In [14]:
df.fillna(value='fill value')
# fill in a fixed value

            A           B  C
0           1           5  1
1           2  fill value  2
2  fill value  fill value  3

In [16]:
#fill in the mean of the colum
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Group by

In [1]:
#used for example in SQL
#group together rows based off of a column 
#and perform an aggregate function on them

In [4]:
import numpy as np
import pandas as pd

In [3]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [7]:
byComp = df.groupby('Company')
#Company is the colum it should group by
#this returns a group-by-object 
#just tells where it is in the memory

In [8]:
#on this object, we can call an agregate function:
byComp.mean()
#pandas ignores non-numeric colums (the names)

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [10]:
#Other aggregate functions: 
byComp.sum() #sums up
byComp.std() #standard deviation
byComp.mean() #mean value
byComp.count() # counts the number of instances
byComp.max() #maximum (for strings latest in Alphabet)
byComp.min() #minimum (or earliest letter)

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [11]:
#now we can locate one value: 
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [13]:
#all in one line:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [15]:
#the coolest:
df.groupby('Company').describe()
#this gives a bunch of information

                    Sales
Company
FB      count    2.000000
        mean   296.500000
        std     75.660426
        min    243.000000
        25%    269.750000
        50%    296.500000
        75%    323.250000
        max    350.000000
GOOG    count    2.000000
        mean   160.000000
        std     56.568542
        min    120.000000
        25%    140.000000
        50%    160.000000
        75%    180.000000
        max    200.000000
MSFT    count    2.000000
        mean   232.000000
        std    152.735065
        min    124.000000
        25%    178.000000
        50%    232.000000
        75%    286.000000
        max    340.000000

In [17]:
#transpose if you like another style:
df.groupby('Company').describe().transpose()

Company    FB                                                         GOOG  \
        count   mean        std    min     25%    50%     75%    max count
Sales     2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0   2.0

Company         ...                  MSFT                                   \
          mean  ...      75%    max count   mean         std    min    25%
Sales    160.0  ...    180.0  200.0   2.0  232.0  152.735065  124.0  178.0

Company
           50%    75%    max
Sales    232.0  286.0  340.0

[1 rows x 24 columns]

In [18]:
#Call just one Company off: 
df.groupby('Company').describe().transpose()['FB']

       count   mean        std    min     25%    50%     75%    max
Sales    2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0

## Merging, Joining and Concatenating DataFrames

Concatenation: pd.concat([df1, df2])
- Glues togehter DataFrames. Dimensions should match along the axis you're concatenating on
- axis 0: concat along rows
- axis 1: concat along colums

Merging: pd.merge(df1, df2, how='inner', on='key')
- similar logic as in SQL
- how-default is inner, can also be outer, right, left
- on specifies the shared column on wich should be merged
- on can take list of keys

Joining: df1.join(df2, how='inner')
- similar to merge, but key to merge on are indices

## Operations

Finding Unique Values in a DataFrame: 

Unique-Method: df['Column'].unique()
- returns numpy array with unique arrays
- you can get number by len(whole_expression)
- number given by mehtod .nunique()

value_counts-Method: df['Col'].value_counts()
- returns how many times each value occurred in colum 'Col'

Selecting Data: 

Conditional Selection: df[df['col1']>2]
- combine with '&' for and, '|' for or, '==' for equal

Apply custom function to a dataframe: df['col1'].apply(custom_function)
- can be combined with lambda expressions e.g.: df['col'].apply(lambda x: x*2)

Remove Colums: df.drop('col', axis=1, inplace=True)

Get Colum- and Index-Names: 
- df.columns
- df.index

Sorting and Ordering: 
- df.sort_values('col2') #sorts by column col2
- df.sort_values(by='col2') exact same effect

Find Null values: df.isnull() returns boolean dataframe

Pivot table: creates multi-index dataframe df.pivot_table(values='D', index=['A','B'], colums=['C'])

## Data Input and Output

CSV, Excel, HTML, SQL Files should be in the same location as notebook

Read any supported file: pd.read_ then press tab and select

Save a DataFrame df as file: df.to_ "tab" ('Set_name', index=False) index False does not save index

In [2]:
pwd #check where notebook is on Computer

'/Users/Oskar/Code/datascience'

In [6]:
#Read a .CSV
df = pd.read_csv('example.csv')
df.to_csv('example',index=False)

In [7]:
#Read from Excel file: pandas can only import the data, not formulas
df = pd.read_excel('Name_of_File.xlsx', sheetname='Sheet1')
df.to_excel('Excel_Sample2.xlsx', sheet_name='NewSheet')

In [10]:
#Read HTML-files: "Web-scraping with pandas"
data = pd.read_html('https://www.html_link.com/.../bla.html')
#this will search for all tables in the html,
#make a list of them,
#each item in the list is a DataFrame

In [ ]:
#Read SQL: 
#Note: There are many different flavors/engines of SQL, so look this up before working with pandas

#The key functions are:
#read_sql_table(table_name, con[, schema, ...])
#Read SQL database table into a DataFrame.
#read_sql_query(sql, con[, index_col, ...])
#Read SQL query into a DataFrame.
#read_sql(sql, con[, index_col, ...])
#Read SQL query or database table into a DataFrame.
#DataFrame.to_sql(name, con[, flavor, ...])
#Write records stored in a DataFrame to a SQL database.

from sqlalchemy import create_engine
engine = create_engine('sqlite://:memory:') #creates light-weight sql engine, running in memory
df.to_sql('my_table', engine) #engine is a connection
sqldf = pd.read_sql('my_table', con=engine)

## Useful end-notes:

In [ ]:
#df dataframe
df.head() #shows five rows
df.head(2) #shows the first two rows
#.head() works on series as well

In [11]:
#Return name of highest paid person in dataframe sal:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].max()]['EmployeeName']

#alternatively:
sal.loc[sal['TotalPayBenefits'].idxmax()] #instead of .idxmax(), numpy's .argmax() works as well

In [12]:
#Return number of unique values in dataframe: 
len(sal['JobTitle'].unique())
#or
sal['JobTitle'].nunique()

In [ ]:
count = 0
i = 0
for i in range(len(sal['JobTitle'])):
    if ('chief' in sal['JobTitle'][i].lower().split()):
         count = count + 1
print(count)

#more elegant version: 

def chief_string(title):
    if 'chief' in title.lower().split():
        return True
    else: 
        return False
    
sum(sal['JobTitle'].apply(lambda x: chief_string(x)))

#note: any function can be applied to a dataframe, use .apply()

In [ ]:
#Check whether there is a corrrelation between two colums: 
datafram[['Col1', 'Col2']].corr()

In [ ]:
#Check how many rows and colums DataFrame df has: 
len(df.colums)
len(df.index)

df.info() #using info method, shows list of properties
df.count() #counts the rows

In [1]:
#Methods for Series: 
ser.unique()
ser.nunique()
ser.value_counts() #this already sorts in descending order
ser.head()

In [ ]:
#Multiple conditional selection: brackets!
df[()&()]